# 花蓮公路客運
routes_hualien_THB <- c(
    "1121",
    "1122",
    "1123",
    "1125",
    "1126",
    "1128",
    "1129",
    "1130",
    "1132",
    "1133",
    "1135",
    "1136",
    "1137",
    "1139",
    "1140",
    "1141",
    "1142",
    "1143",
    "1145",
    "8119",
    "8161",
    "8173",
    "8181"
)

# 臺東公路客運
routes_taitung_THB <- c(
    "1145",
    "309",
    "8101",
    "8102",
    "8103",
    "8105",
    "8107",
    "8109",
    "8110",
    "8111",
    "8113",
    "8115",
    "8117",
    "8119",
    "8120",
    "8122",
    "8125",
    "8128",
    "8129",
    "8130",
    "8131",
    "8132",
    "8135",
    "8136",
    "8137",
    "8138",
    "8150",
    "8151",
    "8152",
    "8153",
    "8156",
    "8157",
    "8158",
    "8161",
    "8163",
    "8165",
    "8166",
    "8167",
    "8168",
    "8170",
    "8171",
    "8172",
    "8173",
    "8178",
    "8180",
    "8181"
)

# 注意：公路客運在區分花蓮、台東的定義
# 2022年以所屬業管機關區分，花蓮為臺北區監理所，台東為高雄區監理所
# 2023-2025 年以搭乘路線名稱區分，對於橫跨花蓮、台東的路線如下：
# > intersect(routes_taitung_THB, routes_hualien_THB)
# [1] "1145" "8119" "8161" "8173" "8181"
# ，則兩縣都會包含
# 所以以上 5 條路線會重複出現在花蓮、台東的公路客運，而 2022 年以業管機關區分的結果則不會，這點需要注意。
# 另外，1123 在 2023 年同時出現公路資料、市區資料，在 2024 年只出現在市區資料，在 2025 年後皆未出現。
# 像 1123 這樣的路線，須注意切分時可能會有遺漏。我們也不會一定要 1123 只在歸在市區或公路資料。
